[
  {
    "reviewId": "449726",
    "username": "scenophile",
    "userProfileUrl": "/profile/scenophile",
    "userImage": "https://i.mydramalist.com/0oglr_1t.jpg",
    "rating": 6,
    "title": "This review may contain spoilers   Action-packed —...",
    "reviewText": "This review may contain spoilers   Action-packed — but rushed and without the charm of S1  So I really enjoyed the first season and decided to read through the webtoon before S2 came out. I enjoyed it thoroughly and grew to love the gigantic cast of characters. I was really excited to see how it would be adapted — all while keeping in mind that it’s very different.With that being said, I don’t mind when an adaptation takes creative liberties, but I think this season is not only missing the structure of the webtoon but also the charm of the first season.I think it’s pretty obvious that eight 40-minute episodes is not enough to go through the complete journey the main character goes through in the comics. It’s an epic journey of going to a new school and slowly learning how to make friends again, as well as fighting for them — starting from defeating the mindless bullies, to taking down the one at the top and dismantling the entire system.The drama just goes through everything WAY too fast. It feels like we’re speed-running through fights, dropping backstories in 5-minute conversations, and going from place to place and defeating antagonists without even establishing who they are. It’s unclear why one plot point is leading to the next, and the final fight is so short and so quick, and the drama never established WHY we had to do everything to get to that point.The webtoon really gets us deep inside Si Eun’s mind as he learns who’s who in the hierarchy and how to face each one. Choi Hyo Man / Colton Choi is the first fish — the one whose bark is larger than his bite. Geum Seong Je / Wolf Keum is second — the arrogant and prideful one who is quick to start fights and enjoy them. And finally the story works its way to the top, where we have Na Baek Jin / Donald Na — the charismatic leader and the mastermind fueled by his own tragic backstory.In the drama, it feels like these antagonists run in parallel, and either their motivations aren’t fleshed out well, or they just feel underwhelming. The different schools/factions blur into each other, and the fight against the Union feels more surface level and small-scale — we’re simply shutting down an illegal business and beating an ex-friend, instead of dismantling the entire power structure.Still, Geum Seong Je (played fantastically by Jun Young) is probably my favorite antagonist. Na Baek Jin has great visuals and great acting too, but the changes to the backstory made it too cliche for me, and I also don’t think the show did a great job of establishing how powerful he was and why.As a sequel series, I also think it doesn’t quite have the charm of the previous season.While S1 really focused on Si Eun’s personality of carefully observing personalities and surroundings and implementing science/math into fights — which is what made it stand out in the first place — this season feels a lot more simple, punch-punch-kick-kick. His calculated personality isn’t shining through in the fight scenes anymore, and even outside of fight scenes, he feels a lot more passive and a lot less intentional. Pacing has been the main issue so far and that affects this as well — Si Eun is just not given time to “study” his opponents. And when he does…I think we were in desperate need of more internal monologues because from the outside, it seems like he’s just running around, doing whatever the next plot calls for.I like that we are seeing him go through grief and guilt though and the drama doesn’t shy away from reminding us how much Su Ho shaped his identity — the show is strongest in those moments.I also think the friendships are just a tiny bit less strong, although I love the casting for every single character and I actually REALLY buy into them as a friend group when I see them together. Once again, though, they’re hampered by the short runtime. The group chemistry is fantastic when they’re having fun, but I just can’t buy into the more emotional moments.Compared to season 1, it’s also pretty obvious there’s a new production team, The color grading and cinematography are a little off sometimes, and I really miss the gritty and darker vibes from the first season. This is minor compared to my other issues, but when you take a weirdly satured color scheme and combine it with the glaring pacing problem, it just feels like we lost a lot of tension.One last gripe: I will never like the car accident trope lol. K-drama writers…stop it.  Read More",
    "reviewDate": "11 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.233Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "449730",
    "username": "YourMotherIsCalling",
    "userProfileUrl": "/profile/12004413",
    "userImage": "https://i.mydramalist.com/ABmlDq_1t.gif",
    "rating": 7,
    "title": "A Brutal, Thrilling Sequel That Forgets What Made ...",
    "reviewText": "A Brutal, Thrilling Sequel That Forgets What Made It Special  \"UPDATED REVIEW\"I went into Weak Hero Class 2 with pretty high expectations, and while it definitely delivers a gripping continuation, I can’t say it completely lived up to the raw brilliance of Season 1.On the surface, everything is bigger, and honestly, it’s impressive. Yeon Si-eun’s journey into a new school full of new dangers had me invested from the start. Watching him, Hu-min, Hyun-tak, and Jun-tae slowly forge a bond was probably the emotional highlight for me. Their brotherhood felt messy and real, full of guarded trust and bruised hearts. That part? The show absolutely nails it.But where Season 1 thrived on slow-burn tension and devastating emotional buildup, Season 2 sometimes trades that for spectacle. The fights are frequent, beautifully choreographed, and absolutely brutal - but they’re also a little too polished at times. Some of the raw, desperate edge that made the first season so unforgettable feels sanded down here. It’s more \"cool\" than \"gut-wrenching,\" and personally, I missed that rawness.Another thing: the pacing feels uneven. The first half does a great job building new dynamics and setting up emotional stakes, but as the action ramps up, some of that careful character work gets sidelined. The heart is still there - it's just buried a little deeper under all the chaos.That said, the performances are phenomenal. Ryeoun, especially as Hu-min, is magnetic. His layered performance brings a much-needed emotional anchor when the plot starts to sprint ahead. And Park Ji-hoon continues to be quietly devastating as Si-eun, managing to say so much with so little.At the end of the day, Weak Hero Class 2 is a strong continuation that dares to expand its world, even if it sacrifices some of the emotional intimacy that made its predecessor special. It’s still absolutely binge-worthy - tense, brutal, and sometimes heartbreakingly honest - but it doesn’t quite reach the same unforgettable heights.For me, it’s a solid 7 out of 10. Worth watching. Worth feeling a little heartbroken over. But not quite the masterpiece the first season was.  Read More",
    "reviewDate": "11 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.234Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "449850",
    "username": "Jojo",
    "userProfileUrl": "/profile/Jojo7",
    "userImage": "https://i.mydramalist.com/JBoQWm_1t.gif",
    "rating": 9,
    "title": "A story of survival with four musketeers and a big...",
    "reviewText": "A story of survival with four musketeers and a big bad wolf in the shadows!  This season goes way beyond brains versus brawn , it was personal, way more messier and more human. Si-eun wasn’t just playing chess with bullies anymore. He was stuck in his own head, sort of drowning in everything that went wrong. You could tell he was not just tired, he was done. His grief didn’t scream, it just lingered, thick in the air, showing up in the way he stared too long, the way his hands trembled ever so slightly or how his voice hesitated before answering. He was unraveling quietly, piece by piece, trying to figure out who he was now that everything he trusted had either broken or disappeared. It wasn’t just about beating enemies anymore, it was about surviving for his own sanity and not making the same mistakes again.But it wasn’t all heavy and dark. The friendship between the \"Fantastic Four\" (yes I’m sticking with that) brought a kind of comfort that really stood out. There was something so genuine about the way they had each other’s backs. It wasn’t dramatic or forced, just simple moments of care that made everything feel a little less bleak.For the first time, Si-eun didn’t feel completely alone. He had people beside him who didn’t need him to be strong or strategic all the time ,just there. And those small smiles and laughs they shared, the quiet understanding, honestly made me smile too. It felt like something he had been needing for a long time and finally, he got it.The friendships in Season 2 held strong in ways Season 1 never could. ( I SAID WHAT I SAID!)I hadn’t read the original source material, but I have zero complaints about the new characters that were introduced. Every actor did a great job and each character really felt like they belonged here. Park Hu-min, Seo Jun-tae and Ko Hyeon-tak were especially impressive to me. They perfectly captured the essence of being this goofy, fun-loving ones, but there was always something deeper going on with them. Even when they were joking around or keeping things light, there was this subtle layer of vulnerability that made them feel so real. They each had their own demons to face and I could see that in their performances.Acting was solid across the board for me.I am especially gonna talk about Park JiHoon because as always he was phenomenal. There’s something in his eyes (It's hard to move on). The pain, resolve, sadness that just magically works and enhances every scene. Somebody give that guy a baeksang please! The one thing I had an issue with was the antagonist, Na Baek Jin. To me, he didn’t feel as much of a villain as the show tried to make him out to be. They presented him as this serious, mysterious figure, but I still don’t feel like I understand why he ended up where he was. I needed that backstory to really connect with him and fully hate him. Without that depth, he felt a bit one-dimensional.As for Geum Seong Je, the other antagonist, I had mixed feelings. Since Junyoung was playing the role, maybe I was biased and started seeing the good in him, hoping he would somehow turn out better. But that wasn’t the case. His character felt a little brief, which left me wanting more. I think with a bit more exploration. I hope season 3 ( if there is) serves that! Also, the styling choice of his character was oj point! Those glasses and hair served ! Overall, for me, this season was right on par with season 1. It didn’t disappoint at all! I’m keeping this review spoiler-free, so I won’t get into specific events, but I can honestly say the season made me happy. Sure, the writing had its moments where it felt a bit uneven, but I binged it all in one sitting and that didn’t bother me too much. It was still easy to get hooked and stay invested.Would I recommend it? Absolutely! Please, go watch it! Thank you for reading my review/rant!  Read More",
    "reviewDate": "10 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.236Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "450302",
    "username": "ForumShah",
    "userProfileUrl": "/profile/ForumShah",
    "userImage": "https://i.mydramalist.com/letter/ForumShah",
    "rating": 5.5,
    "title": "This review may contain spoilers   Not as expected...",
    "reviewText": "This review may contain spoilers   Not as expected :(  okay i just finished binge watching this and i have a lot of thoughts*Spoilers in the review*The missed expectations - where is sieun and his brilliant mind used, like why is he seen so less? the main character - the storyline also seems not connecting enough with so many characters - the main point of weak hero was that one lonely kid with his analytic mind defeating the bad guys- the negative characters stroyline is also not working, why take such characters to show the ruggedness when in the first part one actor with such a baby face also portrayed it perfectly, the characters should resonate with the storyline but i could not feel any connection- the scene where sieun goes to the bowling alley seems predictable enough but i was looking forward to one-on-one fight with him and seung-je again because their fighting was really awesome but he left and someone else fought him like what, wasnt it a revenge thingy like why would take something like this out?- the last fight scene seemed like something to look forward to after such a lengthy period but that too didnt do much justice to the characters fighting for a purpose- the one main head of the negative character didnt even show any bruises with all the punches he got and the others seemed out of it like how come and what's going on?Good Points-- Was really great seeing the character of sieun, he really did a great job once again- the new characters of Jun-tae was also really a nice touch, given the bullying and all and him taking action after hearing sieun- Was really unexpected to see beom-seok in the coma scene of sieun but then i realised the connection, really great capture- The main highlight the great suho waking up and that last scene really brought a smileSummary of mineWeak Hero Class 2 deters away from the main point of having a simple kid with great analysis of fighting and using it to his advantage. The main character of sieun is away from the whole plot line with his strengths like his smartness and all. Neither did the new characters connect much as there are too many characters all at once. The negative characters also dont have a solid storyline. Had much high expectations after the first one really left a great impression in terms a kdrama of this genre :(  Read More",
    "reviewDate": "9 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.237Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "449766",
    "username": "Cheon",
    "userProfileUrl": "/profile/Cheon_",
    "userImage": "https://i.mydramalist.com/73bmZe_1t.png",
    "rating": 8,
    "title": "A Boy with a Pen and His Inner Struggle to Keep Go...",
    "reviewText": "A Boy with a Pen and His Inner Struggle to Keep Going  They did it once again. Somehow, they managed to turn an extremely unrealistic scenario into something so engaging I didn't question it for even a second. From a writing perspective, I'd still say Weak Hero is decent at best, but it offers so many elements that are executed so well, I honestly couldn't care less while watching.I think the second season lost a bit of the charm and vibe the first one had, but to be fair, their structures are pretty different. While Season 1 focused mainly on Si Eun and Su Ho before shifting heavily onto Beom Seok, this one does a better job balancing all the characters. Of course, Si Eun and Hu Min take center stage, but it never felt like the others were overshadowed. Everyone had their role, and everyone mattered to the story. The connection to the characters is just something that this drama pulls off really well.Si Eun is such a great protagonist. I can't fully express how much I like him. After the events of the previous season, I was really curious about what he would do next and how he'd manage to survive. His journey toward slowly finding a reason to live a relatively normal life again was just so good to watch. Si Eun's happy, I'm happy. That's how it works.That being said, I think I used the word 'slowly' a bit excessively, because that journey honestly could've been explored even more. And it's not just about Si Eun, it's about the story overall. At times, it felt like they rushed the events a bit too much instead of stopping at certain points and diving deeper into them. I don't know why it's only 8 episodes again, I think they would really benefit from making it longer here.Back to the positives, this is how you do a show with more than one season. The first Weak Hero did this for me, and the second one managed to pull it off again. Am I satisfied with how it all ended here? Yes. Even if a third season doesn't happen, I'm still happy with what I got. BUT, would I watch a third season if it did happen? 100%. That unsatisfyingly satisfying feel to the ending is something Weak Hero once again pulled off perfectly.The performances were amazing, but it's not like it's surprising considering the cast. We all know that Park Ji Hoon's eyes are built different, and they act better than some actors ever will with their entire face. And while I think everyone did justice to their roles, I really want to appreciate Ryeo Un. It's not easy to take over a spot from a character that so many people loved, but I think he did a really good job here.Audiovisually, it's as good as it was. I think this season has more color though, that bleak aura is slightly missing for me, but overall it's solid. Really happy they didn't change the opening OST.Overall, this is just A+ entertainment for me. Objectively, I'd probably rate it a bit lower, but I just can't, and don't want to hide how much I enjoyed it. The scenario is over the top and the suspension of disbelief is set high, but it's not like the show ever tried to hide that. You start watching, and you know exactly what you're in for.I also want to mention that I haven't read the webtoon, so I can't compare. If some things were left out or changed, I understand why people might be disappointed, but since this is my first time experiencing the story, I'm just happy with what I got.  Read More",
    "reviewDate": "11 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.238Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "450836",
    "username": "fatum",
    "userProfileUrl": "/profile/fatum",
    "userImage": "https://i.mydramalist.com/letter/fatum",
    "rating": 4,
    "title": "2nd season goes full \"webtoon\" fictional mode whic...",
    "reviewText": "2nd season goes full \"webtoon\" fictional mode which degrades all brutality  I liked the first season. It was dynamic and brutal. The second season was a complete garbage in comparison. I was waiting and waiting for the same action from the 1st season... but it was never delivered.My biggest disappointment was how much more unrealistic it became. And when it is so unrealistic - it degrades and diminishes all brutality. What do I mean by that? I mean that if you see how someone hits other person's jaw with a metal knuckle many times with a full force and that jaw remains intact - where is brutality then? Or if someone hits an opponent  many times with a metal knuckle into leg bone and then  that opponents makes a strong kick by that lag - it is ridiculous. Is it a parody now? In the 1st season if objects were used in fight they caused injuries and it made it brutal. The second season lacks this - now it is a parody show.ML is also a complete disappointment. The entire season he speaks as a slowpoke. According to authors it should represent mental trauma, but this shit gets annoying/irritating  over time. In the send I skipped the huge parts of it. For me the show was a complete disappointment because I expected something like season1, but got some weak parody of it.   Read More",
    "reviewDate": "8 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.239Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "449734",
    "username": "AP",
    "userProfileUrl": "/profile/10325835",
    "userImage": "https://i.mydramalist.com/letter/AP",
    "rating": 8,
    "title": "Not the Original  Don't come into this with the ex...",
    "reviewText": "Not the Original  Don't come into this with the expectation that it's going to follow the webtoon it doesn't whatsoever. Don't expect it to compare to season 1 it doesn't whatsoever. However its good for what it is children playing gangster wars.  Gray's combative prowess are far weaker than season 1 or the comics, his ability to study the situation and his environment to produce the most desirable outcome has stagnated.Ben Park seems like a less intriguing role replacement for suho.  Mid cast choice his build doesnt fit.Jung tae dont get me started on this mf didnt like him in the comics either but he plays his role. good cast choiceAlex Go actually was a pretty good character although he wasnt supposed to be a taekwondo major i think they mixed up his character with the green afro hair. Decent character and good cast choice. Wolf keum, by far the best casting ive seen on this show the actor fit the character so well and they stayed true to wolf keum from the comics. Donald na, what a disappointment. Donald Na was far above what was displayed on this show from his combat abilities to his intelligence to his connections to his looks. Firstly donald na is tall, pale, tattooed, blonde with red eyes these are distinct features of the character that add to his identity sure i understand red eyes might be iffy even blonde hair but the height and tattoos are a no go. Hes supposed to be exceptionally smart he would not fall for weak provocation nor would he be outsmarted that easily. His combat ability is so far above grey at this point aswell not to mention his connections. The union was far larger and more powerful, it had political influence aswell.They just made this out to be the same thing as highschool gangster and study group, a bunch of kids fighting.Disappointing for a remake of a book but as a standalone its alright    Read More",
    "reviewDate": "11 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.240Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "449948",
    "username": "Makoto",
    "userProfileUrl": "/profile/MakotoYuki",
    "userImage": "https://i.mydramalist.com/2V16w_1t.jpg",
    "rating": 7,
    "title": "This review may contain spoilers   Doesn't make ju...",
    "reviewText": "This review may contain spoilers   Doesn't make justice to Class 1 and it's main character  Class 1 is one of my favorite dramas, right after watching it I went to read the webtoon and re-watched it a couple of times, so I was looking forward to this new season.They had 2 difficult tasks with it: keep the level of Class 1 and adapt a webtoon that is +250 chapters long. The later was obviously imposible on 8 short episodes, so I was expecting big changes from the webtoon. At the end of class 1 they were teasing the new shcool and a new antagonist in the form of an organization called The Union. How they were introduced made me hopeful.They did the obvious cut out many characters and most of the story, they kept the key characters and did a story that lead to the same ending as the webtoon with a very different path, but keeping some key points. I'm totally fine with this decision, wouldn't mind if story was completely new as well.Class 1 was an original story, based on a ~15 chapters flashback which explained the origins of the main character Si Eun. This rebooted story was a masterpiece on it's own, and, even though the story was different, it had the soul of Weak Hero and Si Eun character gave the same feeling as the original one, some moments even reminded of webtoon best moments... A great way to adapt Weak Hero and a great drama with dark and emotional moments.Sadly this new season doesn't do a good job on adapting Weak Hero. It fails to continue Class 1 and doesn't bring any of the good aspects of the webtoon to the screen. I have multiple complaints about it regarding the story and the characters: the pacing, there wasn't chemistry between the main characters, the villain, fighting scenes felt worse than on Class 1, didn't have emotional moments... It's true that the drama is short, so building up the characters and creating feelings towards them is hard, but Class 1 had the same length and it succeeded.But my main issue about this season is the most important part of Weak Hero: they destroyed Si Eun character.To explain Si Eun character let me talk about his story on the webtoon. Si Eun was a top student, his best friend at school (An Su Ho) starts to get bullied and eventually jumps from a roof while Si Eun was away from school. After this event he stops going to school, he was traumatized, but also he was getting ready to avenge his friend. He's aware that he has a weak body, but he spent his learning techniques that would help him with his revenge and preparing a plan that would guarantee his victory. After months he comes back to school, his classmates thought that he looked like someone who had lost his will, but he carried over his plan and beat everyone responsible for bullying his friend to a pulp. After that he gets transferred to Eunjang a school where fighting is more common than studying. On his first day there the class bully (Choi Hyo Man) targets him but Si Eun doesn't have any problem dealing with him, while he was doing so his desk-mate (Seo Jun Tae) notices that Si Eun hands were trembling, that's how we know that he actually feels fear while fighting but doesn't let it hold him back. During the webtoon we learn that after what happened to his friend he had promised himself to never lose again, he's also someone who doesn't talk much but cares about his friends and doesn't hesitate to help them. He's someone with a weak body, but uses his brain to plan fights and come up with tricks to put him at an advantage when he needs to fight.That Si Eun is exactly who we saw on Class 1 right from the start, he doesn't hesitate to defend himself from bullies even though its obvious he's afraid and has no fighting experience, through the season he grows fond of his friends, doesn't hesitate to go fight instead of them, analyses the situation when fighting... At the end he was someone able to make bullies afraid of him and even fight people more skilled and strong than him They did a good job when writing the first season to create Si Eun character keeping all of his essence and Ji Hoon did an excellent job with the performance. He was someone weak, but he behaved like a hero.On this season they present us Si Eun as someone without will, traumatized by the events after Class 1 he decided to don't fight again. That's not the Si Eun we saw on Class 1, he was someone trying to get stronger to protect his friends, who didn't give. Neither is the Si Eun from the webtoon, who goes through most of the story never losing a fight. Instead they bring us a Si Eun who is only weak. He's not even able to take care of the class bully, someone who is all talk but actually weak. And even when Si Eun recovers his will he never feels like the Si Eun from Class 1.This doesn't only ruin Si Eun character, but also the season pace. They waste so much time with the class bully plot and with Si Eun recovering his will that there's no time to create a proper story for the season.If they were loyal to the last scenes of Class 1 (dealing with the bully on that moment and The Union being aware of Si Eun) they could've started the drama with better pace, creating connections between the characters, a more interesting reason to fight The Union, constructing a better villain... Because Si Eun is not the only character who suffers from this season writing.The villain is another character that was destroyed, its the same one as in the webtoon, it's \"final boss\". But nothing from him remains, not even the iconic tattoos on his hands they showed on Class 1 credits. He is supposed to be a great villain, someone impossible to defeat with a lot of build up, but nothing of it remains. It's disappointing coming from how well Class 1 villain was written.As a summary, the season suffers from bad writing decisions, which ruin the characters, both Si Eun and the new characters introduced on this season, taken from the source material, and it fails on creating an interesting scenario.On the other side, the cast is good. Ji Hoon shows again he was the perfect choice for Si Eun, he can't save the character from the script, but helps keep part of his essence. Geum Seong Je actor does a good job with his character, feeling like the original one.I also liked Seo Jun Tae and Na Baek Jin actors work, even though the latest had a hard job to do.I would still recommend watching the season to anyone who enjoyed Class 1, but it's a shame how the wasted it's potential.  Read More",
    "reviewDate": "10 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.241Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "450064",
    "username": "Anais",
    "userProfileUrl": "/profile/AnaisCd99",
    "userImage": "https://i.mydramalist.com/xR3Pw_1t.gif",
    "rating": 7,
    "title": "Solid, Yet Missing the Spark  I feel like this seq...",
    "reviewText": "Solid, Yet Missing the Spark  I feel like this sequel is a bit bland. Everything, from the interactions to the plot progression, even down to details like the episode lengths, feels very consistent, almost too much so. It’s not necessarily a bad thing; you'd expect some continuity from season 1. But with Netflix involved, I thought they might take a few more risks with the writing. I was hoping for something a little more dynamic, and instead ended up with a sequel that felt monotone, even if it was solidly put together.I felt like Si Eun deserved more time to explore his feelings, thoughts, and inner struggles. The first season handled the characters’ depth wonderfully, but in this sequel, it felt rushed and too repetitive.That said, Jihoon still stands out with his acting, and I still enjoyed the other characters, even if the sense of thrill wasn’t quite there this time. I get the sense they made this sequel mainly to wrap things up cleanly, and to capitalize on the show's initial popularity, but as the producer once said, it wasn't originally planned to have a sequel and I can understand why.   Read More",
    "reviewDate": "10 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.242Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "450666",
    "username": "BL LOVER 1",
    "userProfileUrl": "/profile/BLLOVER1",
    "userImage": "https://i.mydramalist.com/letter/BL LOVER 1",
    "rating": 6.5,
    "title": "A Lot of Action Not A Lot of Substance   Weak Clas...",
    "reviewText": "A Lot of Action Not A Lot of Substance   Weak Class Hero Season 2 and The Uncanny Counter have a lot in common.Their first season slayed and their second season just lost it's way. I feel liked I've Been Waiting so long to be reintroduced to Weak Class Hero 2 but it fell so short for me.Sure it wasn't all bad I mean PARK JI HOON is a national treasure and seeing his performances is what got me through this sub par Second Season. With the added CHOI MIN YEONG I mean that dude is a good little actor and so effing cute.RYEO UN from Twinkling Watermelon was an interesting addition yet his performance also fell short for me and I love that guy.But a last minute return of Su Ho opened up my heart. I'll never watch this Season Again but if a Season 3 emerged from this mess that was Season 2 as long as PARK JI HOON & CHOI HYUN WOOK are in the cast I'll be there.  Read More",
    "reviewDate": "8 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.242Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "451456",
    "username": "Epiphany",
    "userProfileUrl": "/profile/Pariamr",
    "userImage": "https://i.mydramalist.com/81bJk2_1t.webp",
    "rating": 3,
    "title": "All Style, No Substance  Weak Hero Class is the ki...",
    "reviewText": "All Style, No Substance  Weak Hero Class is the kind of show that pretends to be deep, emotional, and intense — but if you look a little closer, it's really just teenage fantasy wrapped in flashy violence.The level of graphic violence shown is totally unnecessary and even problematic, especially since the overall tone and writing style of the story is clearly aimed at a much younger audience. It's basically a youth-oriented story trapped in an R-rated shell — too violent for teenagers to watch safely, but too shallow and immature for an adult to truly connect with.The school setting is absurdly unrealistic. There are no teachers, no rules, and no adult supervision. It’s like watching a lawless jungle rather than an actual high school. Every episode is a new excuse for yet another exaggerated, over-the-top fight scene, with no consequences, no logic, and little emotional build-up.The story feels like a teenage hero fantasy — the kind that may feel \"cool\" or \"badass\" to a teenager, but from a more mature perspective, the constant brawls, inflated egos, and unrealistic world feel more silly and childish than serious or moving. It’s like watching a shounen action anime, but with live-action actors, blood, and knives instead of colorful animation.And yes, many of the people who are most impressed with this show are probably still in that younger stage of life where wild, dramatic fights and \"lone wolf\" heroes seem meaningful and inspiring. Just like how we all thought Captain Tsubasa or similar anime were amazing as kids — only to later realize how over-the-top and unrealistic they were.That sums up the core of this series: a lot of visual noise, but very little real depth.To be fair, the acting is actually solid. The performances are passionate and convincing — but unfortunately, the script and structure do not give the actors enough meaningful material to work with.In short: Weak Hero rides on style over substance. It’s not a bad series in terms of production, but it seriously lacks thematic maturity, narrative realism, and emotional weight.   Read More",
    "reviewDate": "5 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.243Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  },
  {
    "reviewId": "450766",
    "username": "Swivla",
    "userProfileUrl": "/profile/12987919",
    "userImage": "https://i.mydramalist.com/letter/Swivla",
    "rating": 7,
    "title": "Weak Rehash  The good:- The main character gives a...",
    "reviewText": "Weak Rehash  The good:- The main character gives a great performance.- The music is well suited to the rich emotional themes of this series.The bad:- Most of the charm of S1 is left behind. No mc fight strategies. Characters are not very unique. Conflicts are not interesting.- Netflixification: 8x 30 minute eps is just not enough time to flesh anything out at all. To make it even worse, most scenes feel like they are intentionally milking the clock. You wont see anyone even reach for their phone until it rings 3 full times. Everyone talks incredibly slow, which at first seems to be for dramatic effect but at some point its just not done well, and gives the impression they are just filling time.- Nothing new or original at all. Especially if you watched S1 and Study Group and any other basic bully dramas then there is absolutely nothing new in this, and nothing done especially well in comparison to other dramas.- A new friend group is just inserted without much premise, and immediately just have the same camaraderie as S1 friends, which feels forced. Nobody in this season feels real/interesting.- Highschool students played by fully adult actors is jarring.- Bullies and thugs are all flat cardboard cutouts.- Not a single female character in sight, other than his mom.- Relationship with his mom is touched on but not explored at all. Barely any backstory or context for any of the characters.- Most new characters are terribly overacted, somehow both cartoonish and also bland.- The new friend played by a major actor is very forced to try to fill in as Suho vibes, which just feels derivative. We are also supposed to believe he is some kind of powerhouse, but he just looks like an idol.- The fights are all just brawls, where everyone keeps their hands at their sides and just trade hits to the face while refusing to even try to block. I guess they don't need to block since punches to the face barely faze anyone- This whole season feels like its mocking the mc whenever he fights. He will grab so many pens and just get them taken from him and endlessly whiff. He actually seems to have gotten much worse at fighting, so the entire season we just watch him get beat down. I don't think there was a single satisfying \"hero\" moment in this entire season.  Read More",
    "reviewDate": "8 days ago",
    "helpfulCount": 0,
    "createdAt": "2025-05-06T04:52:40.244Z",
    "sourceUrl": "https://mydramalist.com/702271-weak-hero-season-2/reviews"
  }
]